InformationRegisters/ЗаказыТорговыхПлощадок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗаказыТорговыхПлощадок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиМаркетплейсов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовТорговыхПлощадок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДействияПриОбменеСТорговымиПлощадками</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторЗаказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерЗаказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерОтправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторСкладаТорговойПлощадки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаУстановкиСтатуса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСозданияЗаказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРодительскогоОтправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСкладаТорговойПлощадки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяЗаполнениеСведенийПоТоварам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяПолучениеЭтикеток</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗаданияПолученияЭтикеток</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОтгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеСведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказЮридическогоЛица</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИдентификаторОтправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоТестовыйЗаказ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОтгрузки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровХранителю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДополнительныеСведенияПоТоварамЗаказовТорговыхПлощадок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДополнительныеСведенияПоТоварамЗаказовТорговыхПлощадок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТребуетсяСтранаПроисхождения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяНомерГТД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяРНПТ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяМаркировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяУИН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СтранаПроисхождения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерГТД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтрихкодУпаковки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтрихкодыУпаковокТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолныйКодМаркировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УИН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОтправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРодительскогоОтправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОтгрузки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровХранителю</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверкаПройдена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОбъектаМаркетплейса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОтправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторТовара</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЭкземпляра</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗаказыТорговыхПлощадок/Forms/ПросмотрИЗагрузкаЗаказов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УчетнаяЗапись = Параметры.УчетнаяЗапись;
	ТорговаяПлощадка = ИнтеграцияСМаркетплейсамиПовтИсп.ВидМаркетплейсаУчетнойЗаписи(УчетнаяЗапись);
	
	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	НачалоПериода = НачалоДня(ТекущаяДатаСеанса());
	КонецПериода  = КонецДня(ТекущаяДатаСеанса());
	
	Заголовок = Параметры.ЗаголовокФормы;
	ЭтоFBO    = Параметры.ЭтоFBO;
		
	Если ЭтоFBO Тогда
		Элементы.ДекорацияФильтрСтатуса.Ширина                  = 5;
		Элементы.ГруппаФильтрПериода.Видимость                  = Ложь;
		Элементы.ФильтрСопоставления.Видимость                  = Ложь;
		Элементы.ГруппаДокументы.Видимость                      = Ложь;
		Элементы.Действия.Видимость                             = Ложь;
		Элементы.КонтекстноеМенюКомандыFBS.Видимость            = Ложь;
		Элементы.ТаблицаЗаказовДатаОтгрузки.Видимость           = Ложь;
		Элементы.ТаблицаЗаказовГруппаДанныеДоставки.Видимость   = Ложь;
		Элементы.ТаблицаЗаказовГородДоставки.Видимость          = Ложь;
		Элементы.ТаблицаЗаказовДополнительныеСведения.Видимость = Ложь;
	Иначе
		ФильтрДаты          = "ДатаСоздания";
		ФильтрСопоставления = "Все";
	КонецЕсли;
	
	НастроитьФормуПоУчетнойЗаписи();
	УстановитьУсловноеОформление();
	УправлениеВидимостьюДоступностью();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПроверитьПериодИПолучитьОтправленияНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если (ИмяСобытия = "МП_ВыполненаЗагрузкаЗаказовТорговойПлощадки"
				Или ИмяСобытия = "МП_ВыполненоПодтверждениеСборкиЗаказовНаТорговойПлощадке"
				Или ИмяСобытия = "МП_ВыполненоОткрытиеСпораНаТорговойПлощадке"
				Или ИмяСобытия = "МП_ВыполненВозвратКОтгрузкеНаТорговойПлощадке")
			И Не ЭтоFBO
			И Параметр = УчетнаяЗапись Тогда
		ОпределитьДокументыFBS();
		ОбновитьТекстДокументыНаОсновании();
		
	ИначеЕсли ИмяСобытия = "МП_ВыполненаОтменаСборкиЗаказовНаТорговойПлощадке" И Не ЭтоFBO Тогда
		ПараметрыОповещения = ИнтеграцияСМаркетплейсамиКлиент.НовыеПараметрыОповещенияОбОтменеСборкиЗаказа();
		ЗаполнитьЗначенияСвойств(ПараметрыОповещения, Параметр);
		
		Если ПараметрыОповещения.УчетнаяЗапись = УчетнаяЗапись Тогда
			ОбновитьТаблицуЗаказовПослеОтменыСборки(ПараметрыОповещения);
			ОбновитьТекстДокументыНаОсновании();
		КонецЕсли;
		
	ИначеЕсли (ИмяСобытия = "МП_ОбновлениеСведенийПоЗаказамИОтправлениям"
					Или ИмяСобытия = "Запись_ЗаказКлиента"
					Или ИмяСобытия = "Запись_РеализацияТоваровУслуг"
					Или ИмяСобытия = "Запись_ПередачаТоваровХранителю")
				И Не ЭтоFBO Тогда
		ОпределитьДокументыFBS();
		ОбновитьТекстДокументыНаОсновании();
		
	ИначеЕсли ИмяСобытия = "Запись_НаборКонстант"
				И (Источник = "ИспользоватьЗаказыКлиентов"
					Или Источник = "ИспользоватьРасширенныеВозможностиЗаказаКлиента") Тогда
		УправлениеВидимостьюДоступностью();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	
	ДатаАктуальностиДанных = Дата(1, 1, 1);
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	ВыбранноеЗначение      = НачалоДня(ВыбранноеЗначение);
	ДатаАктуальностиДанных = Дата(1, 1, 1);
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	
	ДатаАктуальностиДанных = Дата(1, 1, 1);
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ВыбранноеЗначение      = КонецДня(ВыбранноеЗначение);
	ДатаАктуальностиДанных = Дата(1, 1, 1);
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрСтатусаПриИзменении(Элемент)
	
	УстановитьОтбор();
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрСтатусаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ФильтрСтатуса = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовТорговыхПлощадок.ПустаяСсылка");
	
	УстановитьОтбор();
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПоСкладамПриИзменении(Элемент)
	
	УстановитьОтбор();
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрСопоставленияПриИзменении(Элемент)
	
	УстановитьОтбор();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ДокументОтгрузкиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.ТаблицаЗаказов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.ДокументОтгрузки) = Тип("СписокЗначений") Тогда
		Результат = Ждать ТекущиеДанные.ДокументОтгрузки.ВыбратьЭлементАсинх(НСтр("ru = 'Документ отгрузки'"));
		
		Если Результат <> Неопределено Тогда
			ПоказатьЗначение(Неопределено, Результат.Значение);
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.ДокументОтгрузки) Тогда
		ПоказатьЗначение(Неопределено, ТекущиеДанные.ДокументОтгрузки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстДокументыНаОснованииОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.ТаблицаЗаказов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьЗаказ" Тогда
		ПоказатьЗначение(Неопределено, ТекущиеДанные.ДокументЗаказа);
	
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьДокументОтгрузки" Тогда
		ПоказатьЗначение(Неопределено, ТекущиеДанные.ДокументОтгрузки);
	
	ИначеЕсли СтрНайти(НавигационнаяСсылкаФорматированнойСтроки, "ОткрытьДокументОтгрузки") > 0 Тогда
		Индекс = Число(СтрЗаменить(НавигационнаяСсылкаФорматированнойСтроки, "ОткрытьДокументОтгрузки", ""));
		ПоказатьЗначение(Неопределено, ТекущиеДанные.ДокументОтгрузки[Индекс].Значение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаЗаказов

&НаКлиенте
Процедура ТаблицаЗаказовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ТаблицаЗаказов.ТекущаяСтрока;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("РегистрСведений.ЗаказыТорговыхПлощадок.Форма.СоставЗаказа",
		ПараметрыПросмотраЗаказа(ТекущаяСтрока),
		ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗаказовПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные            = Элементы.ТаблицаЗаказов.ТекущиеДанные;
	ПредставлениеОтправления = "";
	
	Если Элементы.ГруппаПодвал.Видимость 
			И ТекущиеДанные <> Неопределено Тогда
		ПредставлениеОтправления = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Данные по отправлению %1 заказа %2'"),
				ТекущиеДанные.НомерОтправления,
				ТекущиеДанные.НомерЗаказа);
	КонецЕсли;
		
	ОбновитьТекстДокументыНаОсновании();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗаказовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗаказовПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗаказовПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьПериод(Элемент)
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработкаВыбораПериода", ЭтотОбъект);
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период = Новый СтандартныйПериод(НачалоПериода, КонецПериода);
	Диалог.Показать(ОповещениеОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПериодИПолучитьОтправления(Команда)
	
	ПроверитьПериодИПолучитьОтправленияНаКлиенте();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Дата актуальности
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента      = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДатаАктуальностиДанных.Имя);
	
	ОтборЭлемента                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДатаАктуальностиДанных");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Дата(1, 1, 1);
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПоясняющийОшибкуТекст);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Шрифт",      ШрифтыСтиля.ОбычныйШрифтТекста);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст",      НСтр("ru = '<требуется обновление данных>'"));
	
	// Незагруженные заказы
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ЭлементыТаблицы = ПолучитьПодчиненныеЭлементыФормы(Элементы.ТаблицаЗаказов);
	Для Каждого ЭлементКоллекции Из ЭлементыТаблицы Цикл
		ПолеЭлемента      = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ЭлементКоллекции.Имя);
	КонецЦикла;
	
	ОтборЭлемента                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ФильтрСопоставления");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "Все";
	
	ОтборЭлемента                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаЗаказов.ДокументЗаказа");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПоясняющийТекст);
	
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостьюДоступностью()
	
	Если ЭтоFBO Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияФункциональныхОпций = ИнтеграцияСМаркетплейсамиСервер.ПолучитьФункциональныеОпции(Неопределено);
	ДоступностьКоманд           = ЗначенияФункциональныхОпций.ИспользоватьЗаказыКлиентов
									И ЗначенияФункциональныхОпций.ИспользоватьРасширенныеВозможностиЗаказаКлиента;
	
	Элементы.Действия.Доступность                  = ДоступностьКоманд;
	Элементы.КонтекстноеМенюКомандыFBS.Доступность = ДоступностьКоманд;
	
КонецПроцедуры  

// Настраивает элементы формы в соответствии с данными о торговой площадке.
&НаСервере
Процедура НастроитьФормуПоУчетнойЗаписи()
	
	Элементы.Логотип.Картинка = ИнтеграцияСМаркетплейсамиКлиентСервер.ЛоготипТорговойПлощадки(ТорговаяПлощадка);
	
	Если ИнтеграцияСМаркетплейсамиКлиентСервер.ЭтоOzon(ТорговаяПлощадка) Тогда
		Элементы.ГруппаФильтрПоСкладам.Видимость = Истина;
		Элементы.ДекорацияТестовыйРежим.Видимость = Ложь;
		Элементы.ФильтрДаты.СписокВыбора.Очистить();
		Элементы.ФильтрДаты.СписокВыбора.Добавить("ДатаСоздания",НСтр("ru = 'создания'"));  
		Элементы.ФильтрДаты.СписокВыбора.Добавить("ДатаСборки",НСтр("ru = 'отгрузки'"));                       
		Элементы.ФильтрДаты.СписокВыбора.Добавить("ДатаПередачиВДоставку",НСтр("ru = 'передачи в доставку'")); 
		Элементы.ДекорацияФильтрДатыПодсказка.Подсказка = НСтр("ru = 'Вариант отображения заказов:
													|- по дате создания - заказы в любом статусе;
													|- по дате сборки - только незавершенные заказы;
													|- по дате передачи в доставку - только переданные в доставку заказы.'");
		
		Элементы.ОтменитьСборкуЗаказов.Заголовок = НСтр("ru = 'Отменить сборку/доставку'"); 
		Элементы.КонтекстноеМенюОтменитьСборкуЗаказов.Заголовок = НСтр("ru = 'Отменить сборку/доставку'");
		Элементы.ГруппаКомандыПередачиВДоставку.Видимость = Истина;
		Элементы.ГруппаКомандыРаботыСоСпорнымиЗаказами.Видимость = Истина;
		Элементы.КонтекстноеМенюГруппаКомандыРаботыСоСпорнымиЗаказами.Видимость = Истина; 
		Элементы.ТаблицаЗаказовДополнительныеСведения.Видимость = Истина;
		
	ИначеЕсли ИнтеграцияСМаркетплейсамиКлиентСервер.ЭтоЯндексМаркет(ТорговаяПлощадка) Тогда
		Элементы.ГруппаФильтрПоСкладам.Видимость = Ложь;
		Элементы.ДекорацияТестовыйРежим.Видимость =
			ИнтеграцияСЯндексМаркетСервер.ВключенТестовыйРежимЗаказов(УчетнаяЗапись);
		
		Элементы.ФильтрДаты.СписокВыбора.Очистить();
		Элементы.ФильтрДаты.СписокВыбора.Добавить(
			ИнтеграцияСЯндексМаркетСервер.ВидФильтраПоДатеСоздания(), НСтр("ru = 'создания'"));
		Элементы.ФильтрДаты.СписокВыбора.Добавить(
			ИнтеграцияСЯндексМаркетСервер.ВидФильтраПоДатеОтгрузки(), НСтр("ru = 'отгрузки'"));
		Элементы.ФильтрДаты.СписокВыбора.Добавить(
			ИнтеграцияСЯндексМаркетСервер.ВидФильтраПоДатеОбновленияСтатуса(), НСтр("ru = 'обновления статуса заказа'"));
			
		Элементы.ДекорацияФильтрДатыПодсказка.Подсказка = НСтр("ru = 'Вариант отображения заказов:
													|- по дате создания - заказы, с датой создания в указанном периоде;
													|- по дате отгрузки - заказы, с датой отгрузки в доставку до торговой площадки в указанном периоде;
													|- по дате обновления статуса заказа - заказы, обновление статусов которых произошло в указанном периоде 
													|  (рекомендуется использовать фильтр по дате обновления статуса для отслеживании заказов, переданных в доставку до покупателя).'");
		
		Элементы.ОтменитьСборкуЗаказов.Заголовок = НСтр("ru = 'Отменить сборку'");
		Элементы.КонтекстноеМенюОтменитьСборкуЗаказов.Заголовок = НСтр("ru = 'Отменить сборку'"); 
		Элементы.ГруппаКомандыПередачиВДоставку.Видимость = Ложь;
		Элементы.ГруппаКомандыРаботыСоСпорнымиЗаказами.Видимость = Ложь;
		Элементы.КонтекстноеМенюГруппаКомандыРаботыСоСпорнымиЗаказами.Видимость = Ложь;
		Элементы.ТаблицаЗаказовДатаНачалаОбработкиОтправления.Заголовок = НСтр("ru = 'Дата обновления статуса'");
		Элементы.ТаблицаЗаказовДополнительныеСведения.Видимость = Ложь;
		
		Элементы.НачалоПериода.ФорматРедактирования = "ДЛФ=D";
		Элементы.КонецПериода.ФорматРедактирования = "ДЛФ=D";
		Элементы.ТаблицаЗаказовДатаОтгрузки.Формат = "ДЛФ=D";
		
		Элементы.ТаблицаЗаказовТипДоставки.Видимость = Ложь;
		
	КонецЕсли;
	
	Перечисления.СтатусыЗаказовТорговыхПлощадок.ЗаполнитьСписокВыбора(Элементы.ФильтрСтатуса.СписокВыбора, ТорговаяПлощадка);
	
КонецПроцедуры

// Определяет подчиненные элементы.
//
// Параметры:
//   Элемент - ЭлементыФормы - родительский элемент.
//
// Возвращаемое значение:
//   Массив Из ЭлементыФормы - подчиненные элементы.
//
&НаСервере
Функция ПолучитьПодчиненныеЭлементыФормы(Знач Элемент)
	
	Результат = Новый Массив;
	
	Для Каждого ЭлементКоллекции Из Элемент.ПодчиненныеЭлементы Цикл
		Если ТипЗнч(ЭлементКоллекции) = Тип("ГруппаФормы") Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Результат, ПолучитьПодчиненныеЭлементыФормы(ЭлементКоллекции));
		Иначе
			Результат.Добавить(ЭлементКоллекции);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Обработчик события выбора периода.
//
// Параметры:
//   Период - СтандартныйПериод - выбранный период.
//   ДополнительныеПараметры - Неопределено, Произвольный - переданные дополнительные параметры.
//
&НаКлиенте
Процедура ОбработкаВыбораПериода(Период, ДополнительныеПараметры) Экспорт
	
	Если Период <> Неопределено Тогда
		НачалоПериода = НачалоДня(Период.ДатаНачала);
		КонецПериода  = КонецДня(Период.ДатаОкончания);
		
		ДатаАктуальностиДанных = Дата(1, 1, 1);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтбор()
	
	Отбор = Новый Структура;
	
	Если ЗначениеЗаполнено(ФильтрСтатуса) Тогда
		Отбор.Вставить("СтатусОтправления", ФильтрСтатуса);
	КонецЕсли;
	
	Если Не ЭтоFBO Тогда   
		Если ЗначениеЗаполнено(ФильтрПоСкладам) Тогда
			Отбор.Вставить("ИдентификаторСклада", ФильтрПоСкладам);
		КонецЕсли;
		Если ФильтрСопоставления = "Незагруженные" Тогда
			Отбор.Вставить("Сопоставлено", Ложь);
		КонецЕсли;
	КонецЕсли;
	
	Если Отбор.Количество() > 0 Тогда
		Элементы.ТаблицаЗаказов.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
	Иначе
		Элементы.ТаблицаЗаказов.ОтборСтрок = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПериодИПолучитьОтправленияНаКлиенте()
	
	ОчиститьСообщения();   
	
	Если НачалоПериода > КонецПериода Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Некорректно задан период: дата окончания ранее даты начала.'"), , "НачалоПериода");
		Возврат;
	КонецЕсли;
	
	РазницаВДнях = (НачалоДня(КонецПериода) - НачалоДня(НачалоПериода)) / (60 * 60 * 24);     
	
	Если РазницаВДнях > 30 Тогда
		ТекстВопроса = Нстр("ru = 'Период запроса данных превышает месяц. 
								  |Чтобы избежать долгой загрузки данных рекомендуется сократить запрашиваемый период.
								  |Продолжить получение данных?'");
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПроверитьПериодИПолучитьОтправленияЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ОповещениеОЗавершении, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
		
	Иначе
		ПроверитьПериодИПолучитьОтправленияЗавершение(КодВозвратаДиалога.Да, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПериодИПолучитьОтправленияЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ПолучитьОтправленияНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьОтправленияНаКлиенте()
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПолучитьОтправленияЗавершениеФоновогоЗадания", ЭтотОбъект);
	ДлительнаяОперация    = ПолучитьОтправленияНаСервере();
	
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, ДлительнаяОперация);
		
	Иначе
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания			   = Истина;
		ПараметрыОжидания.ТекстСообщения				   = НСтр("ru = 'Получение данных о заказах'") + " " + ?(ЭтоFBO, "FBO", "FBS") + ".";
		ПараметрыОжидания.ОповещениеПользователя.Показать  = Истина;   
		Если ИнтеграцияСМаркетплейсамиКлиентСервер.ЭтоOzon(ТорговаяПлощадка) Тогда
			НаименованиеТорговойПлощадки = НСтр("ru = 'Ozon'");	
		ИначеЕсли ИнтеграцияСМаркетплейсамиКлиентСервер.ЭтоЯндексМаркет(ТорговаяПлощадка) Тогда
			НаименованиеТорговойПлощадки = НСтр("ru = 'Яндекс Маркет'");
		КонецЕсли;			
		ПараметрыОжидания.ОповещениеПользователя.Текст 	   = НаименованиеТорговойПлощадки;
		ПараметрыОжидания.ОповещениеПользователя.Пояснение = НСтр("ru = 'Завершено получение данных о заказах FBS'") + " " + ?(ЭтоFBO, "FBO", "FBS") + ".";
		Логотип = ИнтеграцияСМаркетплейсамиКлиентСервер.ЛоготипТорговойПлощадки(ТорговаяПлощадка);
		ПараметрыОжидания.ОповещениеПользователя.Картинка  = Логотип;
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОтправленияНаСервере()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение            = 0;   
	
	ЭтоOzon = ИнтеграцияСМаркетплейсамиКлиентСервер.ЭтоOzon(ТорговаяПлощадка);
	ЭтоЯндексМаркет = ИнтеграцияСМаркетплейсамиКлиентСервер.ЭтоЯндексМаркет(ТорговаяПлощадка);
	
	Если ЭтоOzon Тогда
		НаименованиеФоновогоЗадания = НСтр("ru = 'Ozon. Получение данных о заказах'") + " " + ?(ЭтоFBO, "FBO", "FBS") + ".";	
	ИначеЕсли ЭтоЯндексМаркет Тогда
		НаименованиеФоновогоЗадания = НСтр("ru = 'Яндекс Маркет. Получение данных о заказах FBS.'");
	КонецЕсли;	
	ПараметрыВыполнения.НаименованиеФоновогоЗадания  = НаименованиеФоновогоЗадания;
	ПараметрыВыполнения.ЗапуститьВФоне               = Истина;
	ПараметрыВыполнения.ПрерватьВыполнениеЕслиОшибка = Истина;
	
	Если ЭтоOzon Тогда
		ПараметрыФункции = Новый Структура;
		ПараметрыФункции.Вставить("НачалоПериода",       НачалоПериода);
		ПараметрыФункции.Вставить("КонецПериода",        КонецПериода);
		ПараметрыФункции.Вставить("ВидФильтраПоПериоду", ФильтрДаты);
		ПараметрыФункции.Вставить("СтатусОтправления",   "");
		ПараметрыФункции.Вставить("ЭтоFBO",              ЭтоFBO);
		
		ИмяМетода = "ИнтеграцияСМаркетплейсомOzonСервер.ПолучитьОтправления";   
	ИначеЕсли ЭтоЯндексМаркет Тогда
		ПараметрыФункции = ИнтеграцияСЯндексМаркетСервер.НовыеПараметрыЗагрузкиЗаказов();
		ПараметрыФункции.Фильтр.ДатаНачала = НачалоПериода;
		ПараметрыФункции.Фильтр.ДатаОкончания = КонецПериода;
		ПараметрыФункции.Фильтр.ВидФильтраПоДате = ФильтрДаты;
		ПараметрыФункции.Фильтр.СтатусЗаказа = ФильтрСтатуса;
		
		ИмяМетода = "ИнтеграцияСЯндексМаркетСервер.ПолучитьЗаказыFBS";
	КонецЕсли;
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
		ИмяМетода,
		УчетнаяЗапись,
		ПараметрыФункции,
		РеквизитФормыВЗначение("ТаблицаЗаказов"));
	
КонецФункции

&НаКлиенте
Процедура ПолучитьОтправленияЗавершениеФоновогоЗадания(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		Если Результат.Статус = "Ошибка" Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
		
		ИначеЕсли Результат.Статус = "Выполнено" Тогда
			Ошибка = ПолучитьОтправленияЗавершениеФоновогоЗаданияНаСервере(Результат.АдресРезультата);
			ИнтеграцияСМаркетплейсомOzonКлиент.ВывестиСостояние(Ошибка, ДополнительныеПараметры, Истина);
			
			Элементы.ТаблицаЗаказов.Обновить();
			ОбновитьТекстДокументыНаОсновании();
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтоFBO Тогда
		УстановитьОтбор();
	Иначе
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПолучениеСпискаСкладовЗавершение", ЭтотОбъект);
		ДлительнаяОперация    = ЗапуститьПолучениеСпискаСкладов(
			ТорговаяПлощадка, УчетнаяЗапись, УникальныйИдентификатор);
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	КонецЕсли;
	
КонецПроцедуры

// Обрабатывает результат получения отправлений.
//
// Параметры:
//   АдресРезультата - Строка - адрес временного хранилища, в которое будет помещен (или уже помещен) результат работы 
//                       процедуры длительной операции.
//
// Возвращаемое значение:
//   См. ИнтеграцияСМаркетплейсамиСервер.НоваяОшибка.
//
&НаСервере
Функция ПолучитьОтправленияЗавершениеФоновогоЗаданияНаСервере(Знач АдресРезультата)
	
	ТаблицаЗаказов.Очистить();
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если ПустаяСтрока(Результат.Ошибка.КодОшибки) Тогда
		ДатаАктуальностиДанных = ТекущаяДатаСеанса();
		ЗначениеВРеквизитФормы(Результат.ТаблицаЗаказов, "ТаблицаЗаказов");
		
		Если Не ЭтоFBO Тогда
			ОпределитьДокументыFBS(Истина);
		КонецЕсли;
		
	Иначе
		ДатаАктуальностиДанных = Дата(1, 1, 1);
	КонецЕсли;
	
	Возврат Результат.Ошибка;
	
КонецФункции

&НаСервере
Функция ПараметрыПросмотраЗаказа(ИдентификаторСтроки)
	
	ТекущиеДанные = ТаблицаЗаказов.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыФормы = РегистрыСведений.ЗаказыТорговыхПлощадок.НовыеПараметрыОткрытияФормыПросмотраЗаказа();
	ЗаполнитьЗначенияСвойств(ПараметрыФормы, ТекущиеДанные);
	
	ПараметрыФормы.УчетнаяЗапись = УчетнаяЗапись;
	ПараметрыФормы.ПричинаОтмены = ТекущиеДанные.ПричинаОтменыОтправления;
	ПараметрыФормы.ЭтоFBO = ЭтоFBO;
	ПараметрыФормы.АдресСодержимогоЗаказа = ПоместитьВоВременноеХранилище(
		ТекущиеДанные.СписокТоваровВОтправлении.Выгрузить());
	
	Возврат ПараметрыФормы;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗапуститьПолучениеСпискаСкладов(ВидМаркетплейса, УчетнаяЗапись, УникальныйИдентификатор)
	
	ПредставлениеВидаТорговойПлощадки = ИнтеграцияСМаркетплейсамиПовтИсп.ПредставлениеВидаТорговойПлощадки(
		ВидМаркетплейса);
	
	НаименованиеФоновогоЗадания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '%1. Получение списка складов.'"),
		ПредставлениеВидаТорговойПлощадки);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеФоновогоЗадания;
	ПараметрыВыполнения.ЗапуститьВФоне              = Истина;
	
	ИмяМетода = "ИнтеграцияСМаркетплейсамиСервер.ПолучитьСкладыСервиса";
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		ИмяМетода,
		ВидМаркетплейса,
		УчетнаяЗапись);
	
КонецФункции

&НаКлиенте
Процедура ПолучениеСпискаСкладовЗавершение(РезультатЗадания, ДополнительныеПараметры) Экспорт
	
	ОчиститьСообщения();
	
	ФильтрПоСкладам = "";
	СписокМетодовДоставки = Новый Структура;
	
	Элементы.ФильтрПоСкладам.СписокВыбора.Очистить();
	Элементы.ФильтрПоСкладам.СписокВыбора.Добавить("", НСтр("ru = 'Все'"));
	
	Если РезультатЗадания <> Неопределено 
			И РезультатЗадания.Статус = "Выполнено" Тогда
		Ошибка = ЗаполнитьСписокСкладовИМетодовДоставки(РезультатЗадания.АдресРезультата);
		
		ИнтеграцияСМаркетплейсамиКлиент.ВывестиСостояние(
			Ошибка,
			,
			Истина,
			Элементы.Логотип.Картинка);
		
	Иначе
		ШаблонОшибки = НСтр("ru = 'Не удалось получить склады учетной записи ""%1"" по причине: %2'");
		ПредставлениеНеизвестнойОшибки = НСтр("ru = 'Неизвестная ошибка выполнения операции'");
		ПодробноеПредставлениеОшибки = ?(РезультатЗадания = Неопределено, ПредставлениеНеизвестнойОшибки, РезультатЗадания.ПодробноеПредставлениеОшибки);
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонОшибки,
				УчетнаяЗапись,
				ПодробноеПредставлениеОшибки);
				
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	
	УстановитьОтбор();
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьСписокСкладовИМетодовДоставки(АдресРезультата)

	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	УдалитьИзВременногоХранилища(АдресРезультата);
	
	Если Результат = Неопределено Тогда
		Возврат ИнтеграцияСМаркетплейсамиСервер.НоваяОшибка();
	КонецЕсли;
	
	ИнтеграцияСМаркетплейсамиСервер.ЗаполнитьСписокСкладовИМетодовДоставки(
		ТорговаяПлощадка,
		Результат.ТаблицаСкладов,
		Элементы.ФильтрПоСкладам.СписокВыбора,
		СписокМетодовДоставки);
	
	Элементы.ФильтрПоСкладам.СписокВыбора.Вставить(0, "", НСтр("ru = 'Все'"));
	
	Возврат Результат.Ошибка; // ИнтеграцияСМаркетплейсамиСервер.НоваяОшибка

КонецФункции

&НаСервере
Процедура ОпределитьДокументыFBS(Знач СтатусыОбновлены = Ложь)
	
	Для Каждого СтрокаТаблицыЗначений Из ТаблицаЗаказов Цикл
		СтрокаТаблицыЗначений.ДокументЗаказа   = Документы.ЗаказКлиента.ПустаяСсылка();
		СтрокаТаблицыЗначений.ДокументОтгрузки = Неопределено;
		СтрокаТаблицыЗначений.Сопоставлено     = Ложь;
	КонецЦикла;
	
	ДокументОтгрузкиВЗаказах =
		ИнтеграцияСМаркетплейсамиСервер.ТребуетсяУказаниеДокументаОтгрузкиВЗаказахТорговыхПлощадок(ТорговаяПлощадка);
	
	Тексты = Новый Массив; // Массив из Строка
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ТаблицаЗаказов.ИдентификаторЗаказа КАК ИдентификаторЗаказа,
		|	ТаблицаЗаказов.НомерЗаказа КАК НомерЗаказа,
		|	ТаблицаЗаказов.НомерОтправления КАК НомерОтправления,
		|	ТаблицаЗаказов.СтатусОтправления КАК СтатусОтправления
		|ПОМЕСТИТЬ ВТ_ТаблицаЗаказов
		|ИЗ
		|	&ТаблицаЗаказов КАК ТаблицаЗаказов
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	НомерЗаказа";
	
	Тексты.Добавить(ТекстЗапроса);
	
	Если ДокументОтгрузкиВЗаказах Тогда
		ТекстЗапроса =
			"ВЫБРАТЬ
			|	ТаблицаЗаказов.ИдентификаторЗаказа КАК ИдентификаторЗаказа,
			|	ТаблицаЗаказов.НомерЗаказа КАК НомерЗаказа,
			|	ТаблицаЗаказов.НомерОтправления КАК НомерОтправления,
			|	ВЫБОР
			|		КОГДА &СтатусыОбновлены
			|			ТОГДА ТаблицаЗаказов.СтатусОтправления
			|		ИНАЧЕ ЕСТЬNULL(ЗаказыТорговыхПлощадок.Статус, ТаблицаЗаказов.СтатусОтправления)
			|	КОНЕЦ КАК СтатусОтправления,
			|	ЕСТЬNULL(ЗаказыТорговыхПлощадок.ДатаУстановкиСтатуса, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаУстановкиСтатуса,
			|	ЕСТЬNULL(ЗаказыТорговыхПлощадок.Заказ, ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)) КАК Заказ,
			|	ЕСТЬNULL(ДокументЗаказКлиента.ПометкаУдаления, ИСТИНА) КАК ЗаказКлиентаПометкаУдаления,
			|	ЕСТЬNULL(ЗаказыТорговыхПлощадок.ДокументОтгрузки, НЕОПРЕДЕЛЕНО) КАК ДокументОтгрузки
			|ИЗ
			|	ВТ_ТаблицаЗаказов КАК ТаблицаЗаказов
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗаказыТорговыхПлощадок КАК ЗаказыТорговыхПлощадок
			|		ПО (ЗаказыТорговыхПлощадок.УчетнаяЗапись = &УчетнаяЗапись)
			|			И ТаблицаЗаказов.НомерОтправления = ЗаказыТорговыхПлощадок.НомерОтправления
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ДокументЗаказКлиента
			|		ПО (ЗаказыТорговыхПлощадок.Заказ = ДокументЗаказКлиента.Ссылка)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ТаблицаЗаказов.ИдентификаторЗаказа,
			|	ТаблицаЗаказов.НомерЗаказа,
			|	ЗаказыТорговыхПлощадок.НомерРодительскогоОтправления,
			|	ЗаказыТорговыхПлощадок.Статус,
			|	ЗаказыТорговыхПлощадок.ДатаУстановкиСтатуса,
			|	ЗаказыТорговыхПлощадок.Заказ,
			|	ЕСТЬNULL(ДокументЗаказКлиента.ПометкаУдаления, ЛОЖЬ),
			|	ЗаказыТорговыхПлощадок.ДокументОтгрузки
			|ИЗ
			|	ВТ_ТаблицаЗаказов КАК ТаблицаЗаказов
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗаказыТорговыхПлощадок КАК ЗаказыТорговыхПлощадок
			|		ПО (ЗаказыТорговыхПлощадок.УчетнаяЗапись = &УчетнаяЗапись)
			|			И ТаблицаЗаказов.НомерОтправления = ЗаказыТорговыхПлощадок.НомерРодительскогоОтправления
			|			И ТаблицаЗаказов.НомерОтправления ПОДОБНО &ПостфиксОтправления
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ДокументЗаказКлиента
			|		ПО (ЗаказыТорговыхПлощадок.Заказ = ДокументЗаказКлиента.Ссылка)
			|ГДЕ
			|	НЕ ЗаказыТорговыхПлощадок.Заказ ЕСТЬ NULL";
	Иначе
		ТекстЗапроса =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ТаблицаЗаказов.ИдентификаторЗаказа КАК ИдентификаторЗаказа,
			|	ТаблицаЗаказов.НомерЗаказа КАК НомерЗаказа,
			|	ТаблицаЗаказов.НомерОтправления КАК НомерОтправления,
			|	ВЫБОР
			|		КОГДА &СтатусыОбновлены
			|			ТОГДА ТаблицаЗаказов.СтатусОтправления
			|		ИНАЧЕ ЕСТЬNULL(ЗаказыТорговыхПлощадок.Статус, ТаблицаЗаказов.СтатусОтправления)
			|	КОНЕЦ КАК СтатусОтправления,
			|	ЕСТЬNULL(ЗаказыТорговыхПлощадок.ДатаУстановкиСтатуса, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаУстановкиСтатуса,
			|	ЕСТЬNULL(ЗаказыТорговыхПлощадок.Заказ, ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)) КАК Заказ,
			|	ЕСТЬNULL(ДокументЗаказКлиента.ПометкаУдаления, ИСТИНА) КАК ЗаказКлиентаПометкаУдаления,
			|	ЕСТЬNULL(Сведения.ДокументОтгрузки, НЕОПРЕДЕЛЕНО) КАК ДокументОтгрузки
			|ИЗ
			|	ВТ_ТаблицаЗаказов КАК ТаблицаЗаказов
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗаказыТорговыхПлощадок КАК ЗаказыТорговыхПлощадок
			|		ПО (ЗаказыТорговыхПлощадок.УчетнаяЗапись = &УчетнаяЗапись)
			|			И ТаблицаЗаказов.НомерОтправления = ЗаказыТорговыхПлощадок.НомерОтправления
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведенияПоТоварамЗаказовТорговыхПлощадок КАК Сведения
			|		ПО (ЗаказыТорговыхПлощадок.Заказ = Сведения.Заказ)
			|			И (ЗаказыТорговыхПлощадок.НомерОтправления = Сведения.НомерРодительскогоОтправления)
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ДокументЗаказКлиента
			|		ПО (ЗаказыТорговыхПлощадок.Заказ = ДокументЗаказКлиента.Ссылка)";
	КонецЕсли;
	
	Тексты.Добавить(ТекстЗапроса);
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрСоединить(Тексты, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	Запрос.УстановитьПараметр("УчетнаяЗапись",       УчетнаяЗапись);
	Запрос.УстановитьПараметр("ТаблицаЗаказов",      ТаблицаЗаказов.Выгрузить());
	Запрос.УстановитьПараметр("ПостфиксОтправления", "%" + РегистрыСведений.ЗаказыТорговыхПлощадок.ПостфиксНовогоОтправления() + "%");
	Запрос.УстановитьПараметр("СтатусыОбновлены",    СтатусыОбновлены);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДанных = РезультатЗапроса.Выбрать();
		
		Для Каждого СтрокаТаблицыЗначений Из ТаблицаЗаказов Цикл
			Отбор = Новый Структура;
			Отбор.Вставить("НомерЗаказа",      СтрокаТаблицыЗначений.НомерЗаказа);
			Отбор.Вставить("НомерОтправления", СтрокаТаблицыЗначений.НомерОтправления);
			
			ВыборкаДанных.Сбросить();
			Пока ВыборкаДанных.НайтиСледующий(Отбор) Цикл
				Если ВыборкаДанных.ДатаУстановкиСтатуса > ДатаАктуальностиДанных Тогда
					СтрокаТаблицыЗначений.СтатусОтправления = ВыборкаДанных.СтатусОтправления;
				КонецЕсли;
				
				Если Не ВыборкаДанных.ЗаказКлиентаПометкаУдаления Тогда
					СтрокаТаблицыЗначений.ДокументЗаказа = ВыборкаДанных.Заказ;
					Если ЗначениеЗаполнено(ВыборкаДанных.ДокументОтгрузки) Тогда
						Если ТипЗнч(СтрокаТаблицыЗначений.ДокументОтгрузки) = Тип("СписокЗначений") Тогда
							СтрокаТаблицыЗначений.ДокументОтгрузки.Добавить(ВыборкаДанных.ДокументОтгрузки);
						ИначеЕсли ЗначениеЗаполнено(СтрокаТаблицыЗначений.ДокументОтгрузки) Тогда
							ДокументОтгрузки = СтрокаТаблицыЗначений.ДокументОтгрузки;
							СтрокаТаблицыЗначений.ДокументОтгрузки = Новый СписокЗначений;
							СтрокаТаблицыЗначений.ДокументОтгрузки.Добавить(ДокументОтгрузки);
							СтрокаТаблицыЗначений.ДокументОтгрузки.Добавить(ВыборкаДанных.ДокументОтгрузки);
						Иначе
							СтрокаТаблицыЗначений.ДокументОтгрузки = ВыборкаДанных.ДокументОтгрузки;
						КонецЕсли;
					КонецЕсли;
					
				Иначе
					СтрокаТаблицыЗначений.ДокументЗаказа   = Документы.ЗаказКлиента.ПустаяСсылка();
					СтрокаТаблицыЗначений.ДокументОтгрузки = Неопределено;
				КонецЕсли;
				
				СтрокаТаблицыЗначений.Сопоставлено = ЗначениеЗаполнено(СтрокаТаблицыЗначений.ДокументЗаказа);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	Элементы.ТаблицаЗаказов.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуЗаказовПослеОтменыСборки(Знач ПараметрыОповещения)
	
	Для Каждого НомерОтправления Из ПараметрыОповещения.НомераОтправлений Цикл // Строка
		СтрокиПоОтправлению = ТаблицаЗаказов.НайтиСтроки(Новый Структура("НомерОтправления", НомерОтправления));
		Для Каждого ДанныеОтправления Из СтрокиПоОтправлению Цикл
			ДанныеОтправления.ПричинаОтменыОтправления = ПараметрыОповещения.ПричинаОтмены;
		КонецЦикла;
	КонецЦикла;
	
	ОпределитьДокументыFBS(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТекстДокументыНаОсновании()
	
	ТекущиеДанные       = Элементы.ТаблицаЗаказов.ТекущиеДанные;
	ИдентификаторСтроки = -1;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ИдентификаторСтроки = ТекущиеДанные.ПолучитьИдентификатор();
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьТекстДокументыНаОсновании", 0.1, Истина);
	
КонецПроцедуры
	
&НаКлиенте
Процедура Подключаемый_ОбновитьТекстДокументыНаОсновании()
	
	ТекущиеДанные = Элементы.ТаблицаЗаказов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Элементы.ТекстДокументыНаОсновании.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Если ИдентификаторСтроки <> ТекущиеДанные.ПолучитьИдентификатор() Тогда
		Возврат;
	КонецЕсли;
	
	ТекстыПоляДокументыНаОсновании.Очистить();
	ЦветТекста = Элементы.ТекстДокументыНаОсновании.ЦветТекста;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ДокументЗаказа) Тогда
		НавигационнаяСсылкаКоманды = "ОткрытьЗаказ";
		ПредставлениеДокумента = Новый ФорматированнаяСтрока(Строка(ТекущиеДанные.ДокументЗаказа),, ЦветТекста,, НавигационнаяСсылкаКоманды);
		ТекстыПоляДокументыНаОсновании.Добавить(ПредставлениеДокумента);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ДокументОтгрузки) Тогда
		Если ТипЗнч(ТекущиеДанные.ДокументОтгрузки) = Тип("СписокЗначений") Тогда
			Для Каждого ЭлементКоллекции Из ТекущиеДанные.ДокументОтгрузки Цикл
				НавигационнаяСсылкаКоманды = "ОткрытьДокументОтгрузки" + Формат(ТекущиеДанные.ДокументОтгрузки.Индекс(ЭлементКоллекции), "ЧН=; ЧГ=0");
				ПредставлениеДокумента = Новый ФорматированнаяСтрока(Строка(ЭлементКоллекции),, ЦветТекста,, НавигационнаяСсылкаКоманды);
				ТекстыПоляДокументыНаОсновании.Добавить(ПредставлениеДокумента);
			КонецЦикла;
		Иначе
			НавигационнаяСсылкаКоманды = "ОткрытьДокументОтгрузки";
			ПредставлениеДокумента = Новый ФорматированнаяСтрока(Строка(ТекущиеДанные.ДокументОтгрузки),, ЦветТекста,, НавигационнаяСсылкаКоманды);
			ТекстыПоляДокументыНаОсновании.Добавить(ПредставлениеДокумента);
		КонецЕсли;
	КонецЕсли;
	
	ОбщегоНазначенияУТКлиентСервер.ОбновитьТекстДокументыНаОсновании(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
